[
    {
        "id":1,
        "course_name":"Vanilla Javascript",
        "cost":100 ,
        "details":"The vanilla script is one of the lightest weight frameworks ever. It is very basic and straightforward to learn as well as to use. You can create significant and influential applications as well as websites using the vanilla script.The team of developers that created the vanilla JavaScript is continuously working on it to improve it and make it more useful for the web-developers. ",

        "image":"https://res.cloudinary.com/practicaldev/image/fetch/s--WGXoQbsM--/c_imagga_scale,f_auto,fl_progressive,h_900,q_auto,w_1600/https://media.licdn.com/mpr/mpr/AAEAAQAAAAAAAAr8AAAAJGUxMTdlYzM4LWZmNmEtNGZiNi05Mjc0LTc1ODQ0MWZmYzU4Nw.png"
    },
    {
        "id":2,
        "course_name":"CSS",
        "cost": 50,
        "details":" Css is a styling language.That makes the user interface more attractive . CSS stands for Cascading Style Sheets. CSS is the language we use to style an HTML document. CSS describes how HTML elements should be displayed.CSS is a cornerstone technology of the World Wide Web, alongside HTML and JavaScript.",

        "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/d/d5/CSS3_logo_and_wordmark.svg/800px-CSS3_logo_and_wordmark.svg.png"
    },
    {
        "id":3,
        "course_name":"Bootstrap 5",
        "cost":50 ,
        "details":"Bootstrap 5 is the newest version of Bootstrap; with new components, faster stylesheet and more responsiveness.",
        "image":"https://blog.getbootstrap.com/assets/img/2020/06/v5-new-logo.png"
    },
    {
        "id":4,
        "course_name":"React JS",
        "cost": 100,
        "details":"ReactJS tutorial provides basic and advanced concepts of ReactJS. Currently, ReactJS is one of the most popular JavaScript front-end libraries which has a strong foundation and a large community.",
        "image":"https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/React-icon.svg/800px-React-icon.svg.png"
    },
    {
        "id":5,
        "course_name":"Angular JS",
        "cost": 100,
        "details":"AngularJS is a discontinued free and open-source JavaScript based web framework for developing single-page applications. It was maintained mainly by Google and a community of individuals and corporations.",

        "image":"https://acquven.com/blog/02/images/angular.jpg"
    },
    {
        "id":6,
        "course_name":"Vue JS",
        "cost": 100,
        "details":"Vue js is an open-source model view viewmodel front end JavaScript framework for building user interfaces and single page applications. It was created by Evan You, and is maintained by him and the rest of the active core team members.",
        "image":"https://www.positivethinking.tech/wp-content/uploads/2021/01/Logo-Vuejs.png"
    }
]